In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
'https://data.worldbank.org/indicator/NY.GDP.MKTP.CD'
'https://data.worldbank.org/indicator/SP.POP.TOTL'
'https://datahub.io/core/co2-fossil-by-nation#python'

### Import Emissions Data

In [54]:
emissions_df = pd.read_csv('Data_Files/fossil-fuel-co2-emissions-by-nation_csv.csv')
emissions_df.head()

,Year,Country,Total,Solid Fuel,Liquid Fuel,Gas Fuel,Cement,Gas Flaring,Per Capita,Bunker fuels (Not in Total)
0,1751,UNITED KINGDOM,2552,2552,0,0,0,0,0.0,0
1,1752,UNITED KINGDOM,2553,2553,0,0,0,0,0.0,0
2,1753,UNITED KINGDOM,2553,2553,0,0,0,0,0.0,0
3,1754,UNITED KINGDOM,2554,2554,0,0,0,0,0.0,0
4,1755,UNITED KINGDOM,2555,2555,0,0,0,0,0.0,0

In [55]:
emissions_df.shape

(17232, 10)

In [56]:
emissions_df.drop(labels = ['Solid Fuel', 'Liquid Fuel', 'Gas Fuel', 'Cement', 'Gas Flaring',
                            'Per Capita', 'Bunker fuels (Not in Total)'], axis = 1, inplace = True)
emissions_df.columns = ['Year', 'Country', 'Fossil_Fuel_CO2_Emissions']
emissions_df.head()

   Year         Country  Fossil_Fuel_CO2_Emissions
0  1751  UNITED KINGDOM                       2552
1  1752  UNITED KINGDOM                       2553
2  1753  UNITED KINGDOM                       2553
3  1754  UNITED KINGDOM                       2554
4  1755  UNITED KINGDOM                       2555

In [57]:
emissions_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17232 entries, 0 to 17231
Data columns (total 3 columns):
Year                         17232 non-null int64
Country                      17232 non-null object
Fossil_Fuel_CO2_Emissions    17232 non-null int64
dtypes: int64(2), object(1)
memory usage: 404.0+ KB

In [58]:
emissions_df.Year.max()

2014

In [59]:
emissions_df = emissions_df[emissions_df.Year >= 1960]

In [60]:
emissions_df.head()

      Year            Country  Fossil_Fuel_CO2_Emissions
6352  1960        AFGHANISTAN                        113
6353  1960            ALBANIA                        552
6354  1960            ALGERIA                       1680
6355  1960             ANGOLA                        150
6356  1960  ANTIGUA & BARBUDA                         10

### Import Population Data

In [12]:
pop_df = pd.read_csv('Data_Files/API_SP.POP.TOTL_DS2_en_csv_v2_656875.csv', skiprows = 4)
pop_df.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Unnamed: 64
0,Aruba,ABW,"Population, total",SP.POP.TOTL,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,...,102046.0,102560.0,103159.0,103774.0,104341.0,104872.0,105366.0,105845.0,NaN,NaN
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8996973.0,9169410.0,9351441.0,9543205.0,9744781.0,9956320.0,...,30117413.0,31161376.0,32269589.0,33370794.0,34413603.0,35383128.0,36296400.0,37172386.0,NaN,NaN
2,Angola,AGO,"Population, total",SP.POP.TOTL,5454933.0,5531472.0,5608539.0,5679458.0,5735044.0,5770570.0,...,24220661.0,25107931.0,26015780.0,26941779.0,27884381.0,28842484.0,29816748.0,30809762.0,NaN,NaN
3,Albania,ALB,"Population, total",SP.POP.TOTL,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,...,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,2873457.0,2866376.0,NaN,NaN
4,Andorra,AND,"Population, total",SP.POP.TOTL,13411.0,14375.0,15370.0,16412.0,17469.0,18549.0,...,83747.0,82427.0,80774.0,79213.0,78011.0,77297.0,77001.0,77006.0,NaN,NaN

In [13]:
pop_df.shape

(264, 65)

In [19]:
pop_df.drop(labels = ['Indicator Name', 'Indicator Code', '2015', '2016',
                      '2017', '2018', '2019', 'Unnamed: 64'], axis = 1, inplace = True)

In [20]:
pop_df.columns

Index(['Country Name', 'Country Code', '1960', '1961', '1962', '1963', '1964',
       '1965', '1966', '1967', '1968', '1969', '1970', '1971', '1972', '1973',
       '1974', '1975', '1976', '1977', '1978', '1979', '1980', '1981', '1982',
       '1983', '1984', '1985', '1986', '1987', '1988', '1989', '1990', '1991',
       '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000',
       '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010', '2011', '2012', '2013', '2014'],
      dtype='object')

In [21]:
val_vars = pop_df.columns[2:]

In [24]:
pop_df = pop_df.melt(id_vars = ['Country Name', 'Country Code'],
                     value_vars = val_vars, var_name = 'Year', value_name = 'Population')

In [33]:
pop_df.head()

  Country Name Country Code  Year  Population
0        Aruba          ABW  1960     54211.0
1  Afghanistan          AFG  1960   8996973.0
2       Angola          AGO  1960   5454933.0
3      Albania          ALB  1960   1608800.0
4      Andorra          AND  1960     13411.0

In [35]:
pop_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14520 entries, 0 to 14519
Data columns (total 4 columns):
Country Name    14520 non-null object
Country Code    14520 non-null object
Year            14520 non-null object
Population      14361 non-null float64
dtypes: float64(1), object(3)
memory usage: 453.9+ KB

In [44]:
pop_df.sort_values(by = ['Country Name', 'Year'], inplace = True)

### Import GDP Data

In [17]:
gdp_df = pd.read_csv('Data_Files/API_NY.GDP.MKTP.CD_DS2_en_csv_v2_656893.csv', skiprows = 4)
gdp_df.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Unnamed: 64
0,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,2.549721e+09,2.534637e+09,2.581564e+09,2.649721e+09,2.691620e+09,2.646927e+09,2.700559e+09,NaN,NaN,NaN
1,Afghanistan,AFG,GDP (current US$),NY.GDP.MKTP.CD,5.377778e+08,5.488889e+08,5.466667e+08,7.511112e+08,8.000000e+08,1.006667e+09,...,1.780428e+10,2.000162e+10,2.056105e+10,2.048487e+10,1.990711e+10,1.936264e+10,2.019176e+10,1.936297e+10,NaN,NaN
2,Angola,AGO,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.117897e+11,1.280529e+11,1.367099e+11,1.457122e+11,1.161936e+11,1.011239e+11,1.221238e+11,1.057510e+11,NaN,NaN
3,Albania,ALB,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.289087e+10,1.231978e+10,1.277628e+10,1.322824e+10,1.138693e+10,1.186135e+10,1.302506e+10,1.510250e+10,NaN,NaN
4,Andorra,AND,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,3.442063e+09,3.164615e+09,3.281585e+09,3.350736e+09,2.811489e+09,2.877312e+09,3.013387e+09,3.236544e+09,NaN,NaN

In [28]:
gdp_df.drop(labels = ['Indicator Name', 'Indicator Code', '2015', '2016',
                      '2017', '2018', '2019', 'Unnamed: 64'], axis = 1, inplace = True)

In [29]:
gdp_df.columns

Index(['Country Name', 'Country Code', '1960', '1961', '1962', '1963', '1964',
       '1965', '1966', '1967', '1968', '1969', '1970', '1971', '1972', '1973',
       '1974', '1975', '1976', '1977', '1978', '1979', '1980', '1981', '1982',
       '1983', '1984', '1985', '1986', '1987', '1988', '1989', '1990', '1991',
       '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000',
       '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010', '2011', '2012', '2013', '2014'],
      dtype='object')

In [30]:
val_vars = gdp_df.columns[2:]

In [31]:
gdp_df = gdp_df.melt(id_vars = ['Country Name', 'Country Code'],
                     value_vars = val_vars, var_name = 'Year', value_name = 'GDP')

In [32]:
gdp_df.head()

  Country Name Country Code  Year           GDP
0        Aruba          ABW  1960           NaN
1  Afghanistan          AFG  1960  5.377778e+08
2       Angola          AGO  1960           NaN
3      Albania          ALB  1960           NaN
4      Andorra          AND  1960           NaN

In [34]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14520 entries, 0 to 14519
Data columns (total 4 columns):
Country Name    14520 non-null object
Country Code    14520 non-null object
Year            14520 non-null object
GDP             11073 non-null float64
dtypes: float64(1), object(3)
memory usage: 453.9+ KB

In [43]:
gdp_df.sort_values(by = ['Country Name', 'Year'], inplace = True)